app/controllers/api/albums_controller.rb

  def index
    render json: Album.all
---
SELECT "albums".* FROM "albums"

  def show
    render json: Album.find_by(id: params[:id])
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]