app/controllers/api/artists_controller.rb

SELECT "artists".* FROM "artists"
---
  def index
    render json: Artist.all

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    render json: Artist.find_by(id: params[:id])